Revit 2015 API
CompoundStructure.GetSimpleCompoundStructure Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public CompoundStructure GetSimpleCompoundStructure(
	double wallHeight,
	double distAboveBase
)
Visual Basic
Public Function GetSimpleCompoundStructure ( _
	wallHeight As Double, _
	distAboveBase As Double _
) As CompoundStructure
Visual C++
public:
CompoundStructure^ GetSimpleCompoundStructure(
	double wallHeight,
	double distAboveBase
)
Parameters
wallHeight
Type: System.Double
distAboveBase
Type: System.Double
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace